const yakuList = [
    // 1飜
    [
        ["立直", false, ""],
        ["一発", false, ""],
        ["嶺上開花", false, ""],
        ["門前清自摸和", false, ""],
        ["海底摸月", false, ""],
        ["河底撈魚", false, ""],
        ["槍槓", false, ""],
        ["断幺九", false, ""],
        ["役牌:自風牌", false, ""],
        ["役牌:場風牌", false, ""],
        ["役牌:三元牌", false, ""],
        ["平和", false, ""],
        ["一盃口", false, ""],
        ["ドラ", false, ""],
        ["裏ドラ", false, ""],
        ["赤ドラ", false, ""],
        ["抜きドラ", false, ""]
    ],
    // 2飜
    [
        ["ダブル立直", false, ""],
        ["一気通貫", false, ""],
        ["三色同刻", false, ""],
        ["三色同順", false, ""],
        ["対々和", false, ""],
        ["三暗刻", false, ""],
        ["三槓子", false, ""],
        ["小三元", false, ""],
        ["七対子", false, ""],
        ["混全帯幺九", false, ""],
        ["混老頭", false, ""]
    ],
    // 3飜
    [
        ["二盃口", false, ""],
        ["純全帯幺九", false, ""],
        ["混一色", false, ""]
    ],
    // 6飜
    [
        ["清一色", false, ""]
    ],
    // 満貫
    [
        ["流し満貫", false, ""]
    ],
    // 役満
    [
        ["天和", false, ""],
        ["地和", false, ""],
        ["大三元", false, ""],
        ["清老頭", false, ""],
        ["字一色", false, ""],
        ["緑一色", false, ""],
        ["四暗刻", false, ""],
        ["四槓子", false, ""],
        ["小四喜", false, ""],
        ["国士無双", false, ""],
        ["九蓮宝燈", false, ""]
    ],
    // ダブル役満
    [
        ["四暗刻単騎", false, ""],
        ["大四喜", false, ""],
        ["国士無双十三面待ち", false, ""],
        ["純正九蓮宝燈", false, ""]
    ]
]


